RedditClone/app/controllers/subs_controller.rb

  def ensure_user_is_moderator
    @page_sub = Sub.find(params[:id])
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]